using System;






namespace Переделанные_хэш_таблицы__под_курсач_
{
  

    internal class Program
    {



        static void Main(string[] args)
        {


            var table = new HashTable(10);

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "1111 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "1111 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "2222 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "2222 243456", "12.08.2020"));


            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "5243 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "5243 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "1235 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "1235 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "5566 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "5566 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "7777 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "7777 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "7788 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "7788 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "8877 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "8877 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "0934 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "0934 243456", "12.08.2020"));

            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "2345 243456", "12.08.2020"));
            table.Delete(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "2345 243456", "12.08.2020"));
            table.Add(new Student("Антонов Курица Толстый", "Б9121-09.03.04", "2345 243456", "12.08.2020"));







            table.Print();


        }
    }




}



